In [47]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn.preprocessing import OneHotEncoder
from sklearn.model_selection import cross_val_score

In [2]:
data = pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/ML/9_decision_tree/Exercise/titanic.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
data.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis = 1 ,inplace = True)

In [4]:
data.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   Fare      891 non-null    float64
dtypes: float64(2), int64(2), object(1)
memory usage: 34.9+ KB

In [18]:
data.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
Fare        0
dtype: int64

In [17]:
data.Age.fillna(data.Age.mean(),inplace = True)

In [21]:
encoder = OneHotEncoder()
encoder.fit(data[['Sex']])
encoder.categories_

[array(['female', 'male'], dtype=object)]

In [33]:
encoded_sex = np.array(encoder.transform(data[['Sex']]).toarray(),dtype = int)
data['encoded_sex'] = encoded_sex[:,1]
data.head()

   Survived  Pclass     Sex   Age     Fare  encoded_sex
0         0       3    male  22.0   7.2500            1
1         1       1  female  38.0  71.2833            0
2         1       3  female  26.0   7.9250            0
3         1       1  female  35.0  53.1000            0
4         0       3    male  35.0   8.0500            1

In [35]:
data.drop(['Sex'],axis = 1, inplace = True)

In [40]:
X = data.drop(['Survived'],axis = 1)
y = data['Survived']

In [44]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size = 0.2)

In [45]:
model = DecisionTreeClassifier()
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [46]:
model.score(X_test,y_test)

0.8212290502793296

In [50]:
np.array(cross_val_score(model,X_test,y_test,cv = 10)).mean()*100

75.52287581699346